hacker/_posts/2017-02-01-Browsing w3m Anonymously With tor.org
#+OPTIONS: H:2 num:nil tags:nil timestamp:t
#+BEGIN_EXPORT html
---
title: Browsing w3m Anonymously With tor
tagline: Combining w3m and tor for anonymous browsing
blog-category: hacker
category:
- hacker
tag:
- hacker
- elisp
- tor
- w3m
- polipo
---
#+END_EXPORT

* Problem

  I'm having fun with [[http://w3m.sourceforge.net/][w3m]] but by using this I discarded several features
  I have neglected with a GUI. One feature is private browsing which
  keeps your history personal and private. (If people were desperate
  enough to check a terminal browser for your secrets.) Just focusing on
  browsing history, configuring it to ignore several sites is easy
  enough with some glue and might warrant its own post.

  Even with [[https://www.mozilla.org/en-US/firefox/new/][firefox]] or [[https://www.google.com/chrome/browser/desktop/index.html][chrome]], using [[https://duckduckgo.com/l/?kh=-1&uddg=https%253A%252F%252Fsupport.mozilla.org%252Fen%252DUS%252Fkb%252FPrivate%252520Browsing][private browsing]] is not enough as
  servers can track your IP and then infer which sites you went to. Not
  truly private but good enough against nosy users. Enter [[https://www.torproject.org/index.html.en][tor]], the
  anonymizing web proxy. What makes it stand out is that it routes
  request through several proxies while encrypting it between them to
  mask where the request comes from and what it contains. It slows down
  browsing speed but it will keep those pesky trackers and advertisers
  from scarily guessing what books or movies you secretly want. For me,
  it is a price I am willing to pay.

  Sadly, that proxy protector is a [[https://en.wikipedia.org/wiki/SOCKS][SOCKS proxy]] and this browser only
  uses [[https://en.wikipedia.org/wiki/Proxy_server][HTTP proxies]]. This means it isn't as easy and straightforward
  combining the two of them, thus we need another middleman to join the
  two. Enter [[https://en.wikipedia.org/wiki/Polipo][polipo]], another proxy server which is lightweight enough
  for our merger. To lay down their relationship, =w3m= will use
  =polipo= as its HTTP proxy which in turn uses =tor= as its SOCKS proxy
  to send the request.

  With that in mind here is the [[https://gist.github.com/0bf59110d447138d7d0a6d227d80f9a4][snippet]] to do so. The first time you run
  this, =tor= might take some time setting up so be patient with that.
  As hackers though, we'd like some more elaboration.

* Configuration Generation

  Once you installed and tried both =tor= and =polipo=, we want Emacs to
  start these proxies when we start =w3m=. You could configure both of
  them to be external services or daemons; however, we want portable or
  standalone setups so that we minimize external dependencies and
  conflicts.

  Our old friend =start-process= comes to our aid again. Practically, we
  want it to call both commands and send config command line options;
  however, we can generate their respective configuration files via
  Elisp so that the configuration can be tested and examined externally
  as well as make the =list-process= entry of each cleaner.

  Both configuration files can be abstracted as a list of key-value pairs or
  cons with different line formatting. The basic snippet to accomplish
  this with =tor=:

  #+BEGIN_SRC emacs-lisp
    (with-temp-file config-file ;; Config file path
      (insert
       (string-join
        (mapcar
         (lambda (pair)
           (pcase-let ((`(,key . ,value) pair))
             (format
              "%s %s" ;; Line formatting
              key ;; Key formatting
              (typecase value ;; Value formatting
                (symbolp (symbol-name value))
                (numberp (number-to-string value))
                (stringp value)))))
         pairs ;; The cons list
         )
        "\n")))
  #+END_SRC

  Aside from using the helpful =with-temp-file= macro and destructring
  =pcase-let=, the only nuance here is the value formatting via
  =typecase=. How you do the formatting affects what values you place.
  For example with =polipo=, our list of =cons= with some stylistic
  backquoting would look something like this:

  #+BEGIN_SRC emacs-lisp
    `(("proxyAddress" . "0.0.0.0")
      ("allowedClients" . "127.0.0.1")
      ("diskCacheRoot" . ,fn/w3m-polipo-cache-dir)
      ("proxyPort" . ,fn/w3m-polipo-port)
      ("cacheIsShared" . false)
      ("socksParentProxy" .
       ,(format "%s:%s" "localhost" (number-to-string fn/w3m-tor-port)))
      ("socksProxyType" . socks5))
  #+END_SRC

  Although the key types are the same, notice there are different value
  types. Strings are quoted, numbers and symbols are stringified; if we
  used just list of line strings, we'd have to do the formatting
  ourselves. With this setup, it looks configurable and proper.

  There is one caveat to this is that everytime you change a value
  within the configuration, you have to update the files. Since there is
  no data binding, you have to update it manually. Thankfully, this is
  easily done with by calling =fn/w3m-polipo-tor-update-conf=
  afterwards.

  As a side note, there is some data binding mechanism using =defcustom=
  and =customize-set-variable= but isn't really needed for a small shiv.
  Also, it is fascinating how generating the files with Elisp allows us
  to ensure they are bound by data and code.

  Now, we can talk about the options we are interested in since I am
  assuming you didn't really read the manuals.

