hacker/_posts/2017-02-01-Browsing w3m Anonymously With tor.html
---
title: Browsing w3m Anonymously With tor
tagline: Combining w3m and tor for anonymous browsing
blog-category: hacker
category:
- hacker
tag:
- hacker
- elisp
- tor
- w3m
- polipo
---

<div id="outline-container-orgbf422ff" class="outline-2">
<h2 id="orgbf422ff">Problem</h2>
<div class="outline-text-2" id="text-orgbf422ff">
<p>
I'm having fun with <a href="http://w3m.sourceforge.net/">w3m</a> but by using this I discarded several features
I have neglected with a GUI. One feature is private browsing which
keeps your history personal and private. (If people were desperate
enough to check a terminal browser for your secrets.) Just focusing on
browsing history, configuring it to ignore several sites is easy
enough with some glue and might warrant its own post.
</p>

<p>
Even with <a href="https://www.mozilla.org/en-US/firefox/new/">firefox</a> or <a href="https://www.google.com/chrome/browser/desktop/index.html">chrome</a>, using <a href="https://duckduckgo.com/l/?kh=-1&amp;uddg=https%3A%2F%2Fsupport.mozilla.org%2Fen%2DUS%2Fkb%2FPrivate%2520Browsing">private browsing</a> is not enough as
servers can track your IP and then infer which sites you went to. Not
truly private but good enough against nosy users. Enter <a href="https://www.torproject.org/index.html.en">tor</a>, the
anonymizing web proxy. What makes it stand out is that it routes
request through several proxies while encrypting it between them to
mask where the request comes from and what it contains. It slows down
browsing speed but it will keep those pesky trackers and advertisers
from scarily guessing what books or movies you secretly want. For me,
it is a price I am willing to pay.
</p>

<p>
Sadly, that proxy protector is a <a href="https://en.wikipedia.org/wiki/SOCKS">SOCKS proxy</a> and this browser only
uses <a href="https://en.wikipedia.org/wiki/Proxy_server">HTTP proxies</a>. This means it isn't as easy and straightforward
combining the two of them, thus we need another middleman to join the
two. Enter <a href="https://en.wikipedia.org/wiki/Polipo">polipo</a>, another proxy server which is lightweight enough
for our merger. To lay down their relationship, <code>w3m</code> will use
<code>polipo</code> as its HTTP proxy which in turn uses <code>tor</code> as its SOCKS proxy
to send the request.
</p>

<p>
With that in mind here is the <a href="https://gist.github.com/0bf59110d447138d7d0a6d227d80f9a4">snippet</a> to do so. The first time you run
this, <code>tor</code> might take some time setting up so be patient with that.
As hackers though, we'd like some more elaboration.
</p>
</div>
</div>

<div id="outline-container-org3c3264b" class="outline-2">
<h2 id="org3c3264b">Configuration Generation</h2>
<div class="outline-text-2" id="text-org3c3264b">
<p>
Once you installed and tried both <code>tor</code> and <code>polipo</code>, we want Emacs to
start these proxies when we start <code>w3m</code>. You could configure both of
them to be external services or daemons; however, we want portable or
standalone setups so that we minimize external dependencies and
conflicts.
</p>

<p>
Our old friend <code>start-process</code> comes to our aid again. Practically, we
want it to call both commands and send config command line options;
however, we can generate their respective configuration files via
Elisp so that the configuration can be tested and examined externally
as well as make the <code>list-process</code> entry of each cleaner.
</p>

<p>
Both configuration files can be abstracted as a list of key-value pairs or
cons with different line formatting. The basic snippet to accomplish
this with <code>tor</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">with-temp-file</span> config-file <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Config file path</span>
  <span style="color: #ff1493;">(</span>insert
   <span style="color: #7fff00;">(</span>string-join
    <span style="color: #00bfff;">(</span>mapcar
     <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #da70d6;">(</span>pair<span style="color: #da70d6;">)</span>
       <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">pcase-let</span> <span style="color: #00ff7f;">(</span><span style="color: #ff8247;">(</span>`<span style="color: #9cb6ad;">(</span>,key . ,value<span style="color: #9cb6ad;">)</span> pair<span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span>
         <span style="color: #00ff7f;">(</span>format
          <span style="color: #68f6cb;">"%s %s"</span> <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Line formatting</span>
          key <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Key formatting</span>
          <span style="color: #ff8247;">(</span><span style="color: #96a5d9; font-weight: bold;">typecase</span> value <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Value formatting</span>
            <span style="color: #9cb6ad;">(</span>symbolp <span style="color: #ff8c00;">(</span>symbol-name value<span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span>
            <span style="color: #9cb6ad;">(</span>numberp <span style="color: #ff8c00;">(</span>number-to-string value<span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span>
            <span style="color: #9cb6ad;">(</span>stringp value<span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span>
     pairs <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">The cons list</span>
     <span style="color: #00bfff;">)</span>
    <span style="color: #68f6cb;">"\n"</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Aside from using the helpful <code>with-temp-file</code> macro and destructring
<code>pcase-let</code>, the only nuance here is the value formatting via
<code>typecase</code>. How you do the formatting affects what values you place.
For example with <code>polipo</code>, our list of <code>cons</code> with some stylistic
backquoting would look something like this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">`<span style="color: #ff8c00;">(</span><span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"proxyAddress"</span> . <span style="color: #68f6cb;">"0.0.0.0"</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"allowedClients"</span> . <span style="color: #68f6cb;">"127.0.0.1"</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"diskCacheRoot"</span> . ,fn/w3m-polipo-cache-dir<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"proxyPort"</span> . ,fn/w3m-polipo-port<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"cacheIsShared"</span> . false<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"socksParentProxy"</span> .
   ,<span style="color: #7fff00;">(</span>format <span style="color: #68f6cb;">"%s:%s"</span> <span style="color: #68f6cb;">"localhost"</span> <span style="color: #00bfff;">(</span>number-to-string fn/w3m-tor-port<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"socksProxyType"</span> . socks5<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Although the key types are the same, notice there are different value
types. Strings are quoted, numbers and symbols are stringified; if we
used just list of line strings, we'd have to do the formatting
ourselves. With this setup, it looks configurable and proper.
</p>

<p>
There is one caveat to this is that everytime you change a value
within the configuration, you have to update the files. Since there is
no data binding, you have to update it manually. Thankfully, this is
easily done with by calling <code>fn/w3m-polipo-tor-update-conf</code>
afterwards.
</p>

<p>
As a side note, there is some data binding mechanism using <code>defcustom</code>
and <code>customize-set-variable</code> but isn't really needed for a small shiv.
Also, it is fascinating how generating the files with Elisp allows us
to ensure they are bound by data and code.
</p>

<p>
Now, we can talk about the options we are interested in since I am
assuming you didn't really read the manuals.
</p>
</div>
</div>
