hacker/_posts/2017-02-01-Browsing w3m Anonymously With tor.org
* tor Options

  The configuration values for =tor=:

  #+BEGIN_SRC emacs-lisp
    `(("SocksPort" . ,fn/w3m-tor-port)
      ("DataDirectory" . ,fn/w3m-tor-cache-dir)
      ("ControlPort" . ,(1+ fn/w3m-tor-port))
      ("DisableDebuggerAttachment" . 0))
  #+END_SRC

  - *SocksPort* ::
       The port which it listens to. More importantly, this port is
       where =polipo= points to.
  - *DataDirectory* ::
       The directory it uses. Not needed, but must be changed since it
       defaults to a system directory
  - *ControlPort* ::
       Optional debugging port if you want to monitor it with tools such
       as [[https://www.torproject.org/index.html.en][arm]].
  - *DisableDebuggerAttachment* ::
       This allows debugging and monitoring which is optional like *ControlPort*

   All we strictly need is the *SocksPort* or the interface port and
   everything else is for portability.

* polipo Options

  The configuration values for =polipo=:

  #+BEGIN_SRC emacs-lisp
    `(("proxyAddress" . "0.0.0.0")
      ("allowedClients" . "127.0.0.1")
      ("diskCacheRoot" . ,fn/w3m-polipo-cache-dir)
      ("proxyPort" . ,fn/w3m-polipo-port)
      ("cacheIsShared" . false)
      ("socksParentProxy" .
       ,(format "%s:%s" "localhost" (number-to-string fn/w3m-tor-port)))
      ("socksProxyType" . socks5))
  #+END_SRC

  - *proxyAddress* ::
       The address this listens to. Since this is standalone,
       *localhost* is the only thing we need.
  - *allowedClients* ::
       The address that this allows. Since you can configure it to
       be a network router, it has this option.
  - *diskCacheRoot* ::
       Like with =tor= and *DataDirectory*.
  - *proxyPort* ::
       The port this listens to which =w3m= uses as its proxy
  - *cacheIsShared* ::
       Set to true if there is only one instance. Since this is
       standalone, it is false.
  - *socksParentProxy* ::
       The SOCKS proxy port it listens to. This is where =tor= and =polipo=
       meet.
  - *socksProxyType* ::
       The SOCKS proxy type. The default =socks5= is what =tor= is.

  A little more nuanced since it is the middle man. What is strictly
  needed here is *proxyPort* and *socksParentProxy* which are just the
  interface ports.

  Now that the options are clear, we move to our browser options.

* w3m Options

  We now look at the main browser and the only external option it needs,
  =http_proxy=. This is simply adding to =w3m-command-arguments= the
  value =http_proxy=https://127.0.0.1:<polipo-port>= after =-o= option
  and that is all there is. It is now just a matter of calling the
  appropriate processes when =w3m= loads:

  #+BEGIN_SRC emacs-lisp
    (setq fn/w3m-tor-process
       (start-process "w3m-tor" "*w3m-tor*" "tor" "-f" fn/w3m-tor-conf-file)
       fn/w3m-polipo-process
       (start-process "w3m-polipo" "*w3m-polipo*" "polipo" "-c" fn/w3m-polipo-conf-file))
  #+END_SRC

  Aside from managing the processes, all the pieces should work together
  properly.

  If there are specialized hosts or domains which you don't need
  anonymity, you should set them via =w3m-no-proxy-domains=:

  #+BEGIN_SRC emacs-lisp
    (add-to-list 'w3m-no-proxy-domains "127.0.0.1")
    (add-to-list 'w3m-no-proxy-domains "localhost")
  #+END_SRC

  As for me, if I don't add this, I can't test my blog since I will get
  a proxy error. Configure to your actual and specific setup.

  Optionally, the proxy might interfere with several sites so a command
  to add the site as a proxy exception:

  #+BEGIN_SRC emacs-lisp
    (defun fn/w3m-add-current-host-to-no-proxy-domains ()
      "Add current host to `w3m-no-proxy-domains'"
      (interactive)
      (when (eq major-mode 'w3m-mode)
        (lexical-let* ((parts (w3m-parse-http-url w3m-current-url))
            (host (elt parts 1)))
          (add-to-list 'w3m-no-proxy-domains host t)
          (w3m-reload-this-page))))
  #+END_SRC

  This adds the current host to =w3m-no-proxy-domains= and reloads the
  page. Hopefully, you would not need to use this command as it
  signifies the roadblocks the proxies bring.

