hacker/_posts/2017-02-01-Browsing w3m Anonymously With tor.html

<div id="outline-container-orgcbc6a38" class="outline-2">
<h2 id="orgcbc6a38">tor Options</h2>
<div class="outline-text-2" id="text-orgcbc6a38">
<p>
The configuration values for <code>tor</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">`<span style="color: #ff8c00;">(</span><span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"SocksPort"</span> . ,fn/w3m-tor-port<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"DataDirectory"</span> . ,fn/w3m-tor-cache-dir<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"ControlPort"</span> . ,<span style="color: #7fff00;">(</span>1+ fn/w3m-tor-port<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"DisableDebuggerAttachment"</span> . 0<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<dl class="org-dl">
<dt><b>SocksPort</b></dt><dd>The port which it listens to. More importantly, this port is
where <code>polipo</code> points to.</dd>
<dt><b>DataDirectory</b></dt><dd>The directory it uses. Not needed, but must be changed since it
defaults to a system directory</dd>
<dt><b>ControlPort</b></dt><dd>Optional debugging port if you want to monitor it with tools such
as <a href="https://www.torproject.org/index.html.en">arm</a>.</dd>
<dt><b>DisableDebuggerAttachment</b></dt><dd><p>
       This allows debugging and monitoring which is optional like <b>ControlPort</b>
</p>

<p>
All we strictly need is the <b>SocksPort</b> or the interface port and
everything else is for portability.
</p></dd>
</dl>
</div>
</div>

<div id="outline-container-org9228bbc" class="outline-2">
<h2 id="org9228bbc">polipo Options</h2>
<div class="outline-text-2" id="text-org9228bbc">
<p>
The configuration values for <code>polipo</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">`<span style="color: #ff8c00;">(</span><span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"proxyAddress"</span> . <span style="color: #68f6cb;">"0.0.0.0"</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"allowedClients"</span> . <span style="color: #68f6cb;">"127.0.0.1"</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"diskCacheRoot"</span> . ,fn/w3m-polipo-cache-dir<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"proxyPort"</span> . ,fn/w3m-polipo-port<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"cacheIsShared"</span> . false<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"socksParentProxy"</span> .
   ,<span style="color: #7fff00;">(</span>format <span style="color: #68f6cb;">"%s:%s"</span> <span style="color: #68f6cb;">"localhost"</span> <span style="color: #00bfff;">(</span>number-to-string fn/w3m-tor-port<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"socksProxyType"</span> . socks5<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<dl class="org-dl">
<dt><b>proxyAddress</b></dt><dd>The address this listens to. Since this is standalone,
<b>localhost</b> is the only thing we need.</dd>
<dt><b>allowedClients</b></dt><dd>The address that this allows. Since you can configure it to
be a network router, it has this option.</dd>
<dt><b>diskCacheRoot</b></dt><dd>Like with <code>tor</code> and <b>DataDirectory</b>.</dd>
<dt><b>proxyPort</b></dt><dd>The port this listens to which <code>w3m</code> uses as its proxy</dd>
<dt><b>cacheIsShared</b></dt><dd>Set to true if there is only one instance. Since this is
standalone, it is false.</dd>
<dt><b>socksParentProxy</b></dt><dd>The SOCKS proxy port it listens to. This is where <code>tor</code> and <code>polipo</code>
meet.</dd>
<dt><b>socksProxyType</b></dt><dd>The SOCKS proxy type. The default <code>socks5</code> is what <code>tor</code> is.</dd>
</dl>

<p>
A little more nuanced since it is the middle man. What is strictly
needed here is <b>proxyPort</b> and <b>socksParentProxy</b> which are just the
interface ports.
</p>

<p>
Now that the options are clear, we move to our browser options.
</p>
</div>
</div>

<div id="outline-container-orgdfa8553" class="outline-2">
<h2 id="orgdfa8553">w3m Options</h2>
<div class="outline-text-2" id="text-orgdfa8553">
<p>
We now look at the main browser and the only external option it needs,
<code>http_proxy</code>. This is simply adding to <code>w3m-command-arguments</code> the
value <code>http_proxy=https://127.0.0.1:&lt;polipo-port&gt;</code> after <code>-o</code> option
and that is all there is. It is now just a matter of calling the
appropriate processes when <code>w3m</code> loads:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> fn/w3m-tor-process
   <span style="color: #ff1493;">(</span>start-process <span style="color: #68f6cb;">"w3m-tor"</span> <span style="color: #68f6cb;">"*w3m-tor*"</span> <span style="color: #68f6cb;">"tor"</span> <span style="color: #68f6cb;">"-f"</span> fn/w3m-tor-conf-file<span style="color: #ff1493;">)</span>
   fn/w3m-polipo-process
   <span style="color: #ff1493;">(</span>start-process <span style="color: #68f6cb;">"w3m-polipo"</span> <span style="color: #68f6cb;">"*w3m-polipo*"</span> <span style="color: #68f6cb;">"polipo"</span> <span style="color: #68f6cb;">"-c"</span> fn/w3m-polipo-conf-file<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Aside from managing the processes, all the pieces should work together
properly.
</p>

<p>
If there are specialized hosts or domains which you don't need
anonymity, you should set them via <code>w3m-no-proxy-domains</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span>add-to-list 'w3m-no-proxy-domains <span style="color: #68f6cb;">"127.0.0.1"</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span>add-to-list 'w3m-no-proxy-domains <span style="color: #68f6cb;">"localhost"</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
As for me, if I don't add this, I can't test my blog since I will get
a proxy error. Configure to your actual and specific setup.
</p>

<p>
Optionally, the proxy might interfere with several sites so a command
to add the site as a proxy exception:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fn/w3m-add-current-host-to-no-proxy-domains</span> <span style="color: #ff1493;">()</span>
  <span style="color: #68f6cb; font-style: italic;">"Add current host to `</span><span style="color: #afc0fd; font-weight: bold; font-style: italic;">w3m-no-proxy-domains</span><span style="color: #68f6cb; font-style: italic;">'"</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">interactive</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">when</span> <span style="color: #7fff00;">(</span>eq major-mode 'w3m-mode<span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lexical-let*</span> <span style="color: #00bfff;">(</span><span style="color: #ffff00;">(</span>parts <span style="color: #da70d6;">(</span>w3m-parse-http-url w3m-current-url<span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span>
        <span style="color: #ffff00;">(</span>host <span style="color: #da70d6;">(</span>elt parts 1<span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>add-to-list 'w3m-no-proxy-domains host t<span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>w3m-reload-this-page<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
This adds the current host to <code>w3m-no-proxy-domains</code> and reloads the
page. Hopefully, you would not need to use this command as it
signifies the roadblocks the proxies bring.
</p>
</div>
</div>
