hacker/_posts/2017-02-01-Browsing w3m Anonymously With tor.org
* Auto Start And Kill

  When =w3m= loads, it might be convenient to start it up. However,
  these processes is not as simple as =flyspell= or the like, so asking
  permission or confirmation as a reminder might be wise. A simple
  snippet does the job:

  #+BEGIN_SRC emacs-lisp
    (when (yes-or-no-p "Start polipo and tor for w3m? ")
      (fn/w3m-polipo-tor-start-process))
  #+END_SRC

  Now the flip side of killing it should be handled when Emacs
  terminates; however for some reason, =tor= doesn't cleanly stop which
  creates a leak that is not visible by =list-process=. Strangely,
  =polipo= closes properly but =tor= does not. So a stronger guarantee
  is to kill it as part of Emacs:

  #+BEGIN_SRC emacs-lisp
    (add-hook 'kill-emacs-hook #'fn/w3m-polipo-tor-kill-process)
  #+END_SRC

  This hook is not a true guarantee as Emacs can be killed externally,
  so this hook will not run, thus =tor= is still running after the next
  session. You can check using =proced= if a =tor= is still running and
  kill it accordingly. This is apparently normal behavior for deamons.

  When Emacs is killed, it sends a SIGHUP signal to its child processes
  or more importantly to the processes made with =start-process=. As
  stated by the manual:

  #+BEGIN_SRC text
    SIGHUP
    The signal instructs Tor to reload its configuration (including closing and reopening
    logs), and kill and restart its helper processes if applicable.
  #+END_SRC

  This means when Emacs is killed externally, it restarts =tor= instead
  of killing it. Sadly, there is no way to change the kill or intercept
  the signal =tor= receives easily. For now, this issue is out of scope
  for a simple process glue. You can create a custom script to start
  =tor=, but this is a reminder that we can't control everything without
  lower level work.

* Conclusion

  With this, we joined =w3m=, =polipo=, =tor= to browse more privately
  and all within Emacs. Not perfect but it gets the job done. There are
  features or aspects that can be improved:

  - Data and argument binding, managing =w3m-command-arguments= as well
  - Error handling
  - Process management on open and close of =w3m=, maybe =prodigy=?
  - Proxy fine tuning and configuration, checkout [[https://gitweb.torproject.org/torbrowser.git/plain/build-scripts/config/polipo.conf?id=1ffcd9dafb9dd76c3a29dd686e05a71a95599fb5][custom polipo conf from tor]]

  The joy of Emacs, gluing things together to get what you want even if
  its just private browsing.
