hacker/_posts/2017-02-01-Browsing w3m Anonymously With tor.html

<div id="outline-container-org03d1c7d" class="outline-2">
<h2 id="org03d1c7d">Auto Start And Kill</h2>
<div class="outline-text-2" id="text-org03d1c7d">
<p>
When <code>w3m</code> loads, it might be convenient to start it up. However,
these processes is not as simple as <code>flyspell</code> or the like, so asking
permission or confirmation as a reminder might be wise. A simple
snippet does the job:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">when</span> <span style="color: #ff1493;">(</span>yes-or-no-p <span style="color: #68f6cb;">"Start polipo and tor for w3m? "</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span>fn/w3m-polipo-tor-start-process<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Now the flip side of killing it should be handled when Emacs
terminates; however for some reason, <code>tor</code> doesn't cleanly stop which
creates a leak that is not visible by <code>list-process</code>. Strangely,
<code>polipo</code> closes properly but <code>tor</code> does not. So a stronger guarantee
is to kill it as part of Emacs:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span>add-hook 'kill-emacs-hook #'fn/w3m-polipo-tor-kill-process<span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
This hook is not a true guarantee as Emacs can be killed externally,
so this hook will not run, thus <code>tor</code> is still running after the next
session. You can check using <code>proced</code> if a <code>tor</code> is still running and
kill it accordingly. This is apparently normal behavior for deamons.
</p>

<p>
When Emacs is killed, it sends a SIGHUP signal to its child processes
or more importantly to the processes made with <code>start-process</code>. As
stated by the manual:
</p>

<div class="org-src-container">
<pre class="src src-text">SIGHUP
The signal instructs Tor to reload its configuration (including closing and reopening
logs), and kill and restart its helper processes if applicable.
</pre>
</div>

<p>
This means when Emacs is killed externally, it restarts <code>tor</code> instead
of killing it. Sadly, there is no way to change the kill or intercept
the signal <code>tor</code> receives easily. For now, this issue is out of scope
for a simple process glue. You can create a custom script to start
<code>tor</code>, but this is a reminder that we can't control everything without
lower level work.
</p>
</div>
</div>

<div id="outline-container-orgeefa3f5" class="outline-2">
<h2 id="orgeefa3f5">Conclusion</h2>
<div class="outline-text-2" id="text-orgeefa3f5">
<p>
With this, we joined <code>w3m</code>, <code>polipo</code>, <code>tor</code> to browse more privately
and all within Emacs. Not perfect but it gets the job done. There are
features or aspects that can be improved:
</p>

<ul class="org-ul">
<li>Data and argument binding, managing <code>w3m-command-arguments</code> as well</li>
<li>Error handling</li>
<li>Process management on open and close of <code>w3m</code>, maybe <code>prodigy</code>?</li>
<li>Proxy fine tuning and configuration, checkout <a href="https://gitweb.torproject.org/torbrowser.git/plain/build-scripts/config/polipo.conf?id=1ffcd9dafb9dd76c3a29dd686e05a71a95599fb5">custom polipo conf from tor</a></li>
</ul>

<p>
The joy of Emacs, gluing things together to get what you want even if
its just private browsing.
</p>
</div>
</div>
